#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/2e52bc4c-f321-4bff-98d8-8ce89cd3e2e7/22f2f067-d74a-4108-bf1a-eb6bffd71736]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/f3d5d424-88cb-472f-a0b9-b99cc342f40f]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/7f31f194-bfcc-43fd-babe-bc9545292ede]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/9dbc8e8b-0e25-44cd-bd1b-34a1846ac269]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.KEYCLOAK_DEV.module.moh_applications.module.PHO-RSC.module.client-roles.keycloak_role.ROLES["demoreports"] has changed
  ~ resource "keycloak_role" "ROLES" {
      + attributes = {}
        id         = "ddcb6c69-65f6-4e4d-8f9f-a1400a41495e"
        name       = "demoreports"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.HDPBC.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + base_url                                  = "https://hdpbc-tst.hlth.gov.bc.ca/"
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "HDPBC"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Health Data Platform BC"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "HDPBC"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "https://dmz1.hdpbc-tst.hlth.gov.bc.ca/*",
          + "https://dmz2.hdpbc-tst.hlth.gov.bc.ca/*",
          + "https://hdpbc-dev.hlth.gov.bc.ca/*",
          + "https://hdpbc-tst.hlth.gov.bc.ca/*",
          + "https://hdpbc.ddev.site/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HDPBC.keycloak_openid_client_default_scopes.client_default_scopes will be created
  + resource "keycloak_openid_client_default_scopes" "client_default_scopes" {
      + client_id      = (known after apply)
      + default_scopes = [
          + "email",
          + "profile",
          + "roles",
          + "web-origins",
        ]
      + id             = (known after apply)
      + realm_id       = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.HDPBC.keycloak_openid_client_optional_scopes.client_optional_scopes will be created
  + resource "keycloak_openid_client_optional_scopes" "client_optional_scopes" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + optional_scopes = [
          + "address",
          + "microprofile-jwt",
          + "offline_access",
          + "phone",
        ]
      + realm_id        = "moh_applications"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @sharpedavid, Action: `pull_request`*